In [6]:
import pandas as pd
import numpy as np

### Create a simple DataFrame

In [4]:
data = pd.DataFrame({'Name':["Ram","Hari","Sita","Sarita"],
                    'Age':[25,27,18,16],
                    'City':["Kathmandu","Lalitpur","Bhaktapur","Pokhara"]})

In [3]:
data

     Name  Age       City
0     Ram   25  Kathmandu
1    Hari   27   Lalitpur
2    Sita   18  Bhaktapur
3  Sarita   16    Pokhara

### Select rows based on a condition

In [12]:
data[data['Age']>25]

   Name  Age      City
1  Hari   27  Lalitpur

### Add a new column

In [13]:
data['Country'] = 'USA'

In [14]:
data

     Name  Age       City Country
0     Ram   25  Kathmandu     USA
1    Hari   27   Lalitpur     USA
2    Sita   18  Bhaktapur     USA
3  Sarita   16    Pokhara     USA

### Change the City of the first row to 'Los Angeles'.

In [15]:
data.iloc[0]

Name             Ram
Age               25
City       Kathmandu
Country          USA
Name: 0, dtype: object

In [16]:
data.iloc[0,2] = "Los Angeles"

In [17]:
data

     Name  Age         City Country
0     Ram   25  Los Angeles     USA
1    Hari   27     Lalitpur     USA
2    Sita   18    Bhaktapur     USA
3  Sarita   16      Pokhara     USA

### Select all rows where Age is greater than 25 and City is 'Lalitpur'

In [24]:
data[(data['Age']>25) & (data["City"]== "Lalitpur")]

   Name  Age      City Country
1  Hari   27  Lalitpur     USA

### Group the data by City and count the number of people in each city.

In [25]:
data.groupby('City').count()

             Name  Age  Country
City
Bhaktapur       1    1        1
Lalitpur        1    1        1
Los Angeles     1    1        1
Pokhara         1    1        1

### Sort the DataFrame by Age in descending order

In [31]:
data.sort_values(by=['Age'], ascending = False)

     Name  Age         City Country
1    Hari   27     Lalitpur     USA
0     Ram   25  Los Angeles     USA
2    Sita   18    Bhaktapur     USA
3  Sarita   16      Pokhara     USA

### Rename the Age column to Years.

In [34]:
data.rename(columns= {"Age":"Years"})

     Name  Years         City Country
0     Ram     25  Los Angeles     USA
1    Hari     27     Lalitpur     USA
2    Sita     18    Bhaktapur     USA
3  Sarita     16      Pokhara     USA

In [35]:
data.to_csv("people.csv")